УТ_для_edt/src/Catalogs/CRM_КартыМаршрутов/CRM_КартыМаршрутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_КартыМаршрутов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЗапросНаИзменениеСроков</name>
      <description>Запрос на изменение сроков исполнения задачи</description>
    </items>
    <items>
      <name>Поручение</name>
      <description>Поручение</description>
    </items>
  </predefined>
  <attributes>
    <name>ГрафическаяСхема</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВИнтересах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <comment>Номер текущей версии карты маршрута</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешеноДосрочноеЗавершение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеБизнесПроцессаВСодержаниеЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсторияБизнесПроцессаВСодержаниеЗадачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьСрокВыполненияЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьДатуВыполненияЗадач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьСрокВыполненияЭтапов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДинамическиРассчитыватьСрокиВыполненияЭтапов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьПричинуНеудачногоЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПеремещатьТекущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтартоватьВФоновомРежимеИзДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроцесса</name>
    <type>
      <types>EnumRef.bpmТипыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьВидОбъекта</name>
    <type>
      <types>EnumRef.bpmВидыОбъектовПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПроцесса</name>
    <type>
      <types>EnumRef.bpmСостояниеПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПриПринятииОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОбъектаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РедактироватьИсполнителейЭтапов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДосрочногоЗавершения</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДляБП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииКартыМаршрута</name>
    <attributes>
      <name>КартаМаршрута</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВерсии</name>
      <comment>Номер данной версии</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <comment>Дата создания версии</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/bpmТипыПроцессов/bpmТипыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>bpmТипыПроцессов</name>
  <enumValues>
    <name>ПроцессОбъекта</name>
  </enumValues>
  <enumValues>
    <name>НезависимыйПроцесс</name>
  </enumValues>
  <enumValues>
    <name>ПоУмолчанию</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/CRM_КартыМаршрутов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Корректирует схему компоновки данных в карте маршрута.
//
// Параметры:
//	КартаМаршрута - СправочникСсылка.CRM_КартыМаршрутов - карта маршрута.
//
Процедура СкорретироватьСКД_В_КартеМаршрутаПроцессе(КартаМаршрута) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект = КартаМаршрута.ПолучитьОбъект();
	Если ТипЗнч(КартаМаршрута) = Тип("СправочникСсылка.CRM_КартыМаршрутов") Тогда
		РеквизитХранилищаСхемыКомпоновкиДанных = "ХранилищеСхемыКомпоновкиДанных";
	Иначе
		РеквизитХранилищаСхемыКомпоновкиДанных = "bpmХранилищеСхемыКомпоновкиДанных";
	КонецЕсли;
	
	Если Объект.ТипПроцесса = Перечисления.bpmТипыПроцессов.ПроцессОбъекта Тогда
		СхемаКомпоновкиДанных		= CRM_БизнесПроцессыПереопределяемый.ПолучитьСхемуКомпоновкиПоИмениОбъекта(Объект.ВидОбъектаСтрокой);
	ИначеЕсли Объект.ТипПроцесса = Перечисления.bpmТипыПроцессов.НезависимыйПроцесс Тогда
		СхемаКомпоновкиДанных		= CRM_БизнесПроцессыПереопределяемый.ПолучитьСхемуКомпоновкиПоИмениОбъекта("Пользователи");
	КонецЕсли;
	
	Объект[РеквизитХранилищаСхемыКомпоновкиДанных] = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
